/*
 * KQEMU
 *
 * Copyright (C) 2004-2008 Fabrice Bellard
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 */
#ifndef __ASSEMBLY__
#include <stddef.h>
#include <stdarg.h>

#ifndef NO_STD_TYPES

typedef unsigned char uint8_t;
typedef unsigned short uint16_t;
typedef unsigned int uint32_t;
#if defined (__x86_64__)
typedef unsigned long uint64_t;
#else
typedef unsigned long long uint64_t;
#endif

typedef signed char int8_t;
typedef signed short int16_t;
typedef signed int int32_t;
#if defined (__x86_64__)
typedef signed long int64_t;
#else
typedef signed long long int64_t;
#endif

#ifndef NULL
#define NULL 0
#endif

#endif

#include "kqemu-kernel.h"

#endif /*! __ASSEMBLY__ */

#define USE_SEG_GP
#define USE_HARD_MMU
/* use the PG global bit for guest user pages (need to make benchmark
   to validate) */
#define USE_USER_PG_GLOBAL
//#define PROFILE

//#define PROFILE_INTERP_PC
//#define PROFILE_INTERP2

#define PG_ORIG_RW_MASK  (1 << PG_ORIG_RW_BIT)

#define PG_ERROR_W_BIT     1

#define PG_ERROR_P_MASK    0x01
#define PG_ERROR_W_MASK    (1 << PG_ERROR_W_BIT)
#define PG_ERROR_U_MASK    0x04
#define PG_ERROR_RSVD_MASK 0x08

#define MSR_IA32_APICBASE               0x1b
#define MSR_IA32_APICBASE_BSP           (1<<8)
#define MSR_IA32_APICBASE_ENABLE        (1<<11)
#define MSR_IA32_APICBASE_BASE          (0xfffff<<12)

#define	APIC_LVR         0x30
#define	APIC_LVTT	 0x320

#define APIC_DM_MASK     0x00700
#define APIC_DM_NMI      0x00400
#define	APIC_LVT_MASKED	(1<<16)

#define MSR_IA32_SYSENTER_CS            0x174
#define MSR_IA32_SYSENTER_ESP           0x175
#define MSR_IA32_SYSENTER_EIP           0x176

#define MSR_EFER                        0xc0000080
#define MSR_EFER_SCE   (1 << 0)
#define MSR_EFER_LME   (1 << 8)
#define MSR_EFER_LMA   (1 << 10)
#define MSR_EFER_NXE   (1 << 11)
#define MSR_EFER_FFXSR (1 << 14)

#define MSR_STAR                        0xc0000081
#define MSR_LSTAR                       0xc0000082
#define MSR_CSTAR                       0xc0000083
#define MSR_FMASK                       0xc0000084
#define MSR_FSBASE                      0xc0000100
#define MSR_GSBASE                      0xc0000101
#define MSR_KERNELGSBASE                0xc0000102

/* cpuid_features bits */
#define CPUID_FP87 (1 << 0)
#define CPUID_VME  (1 << 1)
#define CPUID_DE   (1 << 2)
#define CPUID_PSE  (1 << 3)
#define CPUID_TSC  (1 << 4)
#define CPUID_MSR  (1 << 5)
#define CPUID_PAE  (1 << 6)
#define CPUID_MCE  (1 << 7)
#define CPUID_CX8  (1 << 8)
#define CPUID_APIC (1 << 9)
#define CPUID_SEP  (1 << 11) /* sysenter/sysexit */
#define CPUID_MTRR (1 << 12)
#define CPUID_PGE  (1 << 13)
#define CPUID_MCA  (1 << 14)
#define CPUID_CMOV (1 << 15)
#define CPUID_CLFLUSH (1 << 19)
/* ... */
#define CPUID_MMX  (1 << 23)
#define CPUID_FXSR (1 << 24)
#define CPUID_SSE  (1 << 25)
#define CPUID_SSE2 (1 << 26)

#define CPUID_EXT_SS3      (1 << 0)
#define CPUID_EXT_MONITOR  (1 << 3)
#define CPUID_EXT_CX16     (1 << 13)

#define CPUID_EXT2_SYSCALL (1 << 11)
#define CPUID_EXT2_NX      (1 << 20)
#define CPUID_EXT2_FFXSR   (1 << 25)
#define CPUID_EXT2_LM      (1 << 29)

#define EXCP00_DIVZ	0
#define EXCP01_SSTP	1
#define EXCP02_NMI	2
#define EXCP03_INT3	3
#define EXCP04_INTO	4
#define EXCP05_BOUND	5
#define EXCP06_ILLOP	6
#define EXCP07_PREX	7
#define EXCP08_DBLE	8
#define EXCP09_XERR	9
#define EXCP0A_TSS	10
#define EXCP0B_NOSEG	11
#define EXCP0C_STACK	12
#define EXCP0D_GPF	13
#define EXCP0E_PAGE	14
#define EXCP10_COPR	16
#define EXCP11_ALGN	17
#define EXCP12_MCHK	18

#ifdef _WIN32
#define ASM_NAME(x) _ ## x                
#else
#define ASM_NAME(x) x
#endif
                
#define DUP4(f, n) f(n) f(n + 1) f(n + 2) f(n + 3)
#define DUP16(f, n) DUP4(f, n) DUP4(f, n + 4) DUP4(f, n + 8) DUP4(f, n + 12)
#define DUP64(f, n) DUP16(f, n) DUP16(f, n + 16) DUP16(f, n + 32) DUP16(f, n + 48) 
#define DUP256(f, n) DUP64(f, n) DUP64(f, n + 64) DUP64(f, n + 128) DUP64(f, n + 192)

#ifndef __ASSEMBLY__

/* spinlocks */

typedef struct {
    volatile int lock;
} spinlock_t;

static inline void spin_lock_init(spinlock_t *l)
{
    l->lock = 1;
}

static inline void spin_lock(spinlock_t *l)
{
    asm volatile("1:\n"
                 "lock; decb %0\n"
                 "jns 3f\n"
                 "2:\n"
                 "rep; nop\n"
                 "cmpb $0, %0\n"
                 "jle 2b\n"
                 "jmp 1b\n"
                 "3:\n" 
                 : "=m" (l->lock) 
                 : 
                 : "memory");
}

static inline void spin_unlock(spinlock_t *l)
{
    char val;
    val = 1;

    /* the xchg ensures that the memory I/Os are synchronized */
    asm volatile("xchgb %b0, %1"
                 : "=q" (val), "=m" (l->lock)
                 : "0" (val));
}

/* registers in an exception. Do not modify it without looking at
   monitor_asm.S */
#ifdef __x86_64__
struct kqemu_exception_regs {
    unsigned long eax; /* 0 */
    unsigned long ecx;
    unsigned long edx;
    unsigned long ebx;
    unsigned long esp; /* 4 */
    unsigned long ebp;
    unsigned long esi;
    unsigned long edi;
    unsigned long r8;
    unsigned long r9;
    unsigned long r10;
    unsigned long r11;
    unsigned long r12;
    unsigned long r13;
    unsigned long r14;
    unsigned long r15;
    unsigned long error_code; /* 16 */
    unsigned long eip; /* 17 */
    uint16_t cs_sel; /* 18 */
    uint16_t cs_sel_h[3];
    unsigned long eflags; /* 19 */
    unsigned long esp1; /* 20 */
    uint16_t ss_sel; /* 21 */
    uint16_t ss_sel_h[3];
    /* additionnal space to handle 16 bit return */
    /* NOTE: at this point must be 16 byte aligned */
    unsigned long dummy[4]; /* 22 */
};
#else
struct kqemu_exception_regs {
    uint16_t ds_sel; /* 0 */
    uint16_t ds_sel_h;
    uint16_t es_sel; /* 1 */
    uint16_t es_sel_h;
    uint32_t eax;    /* 2 */
    uint32_t ecx;
    uint32_t edx;
    uint32_t ebx;
    uint32_t esp;  /* 6 */
    uint32_t ebp;
    uint32_t esi;
    uint32_t edi;
    uint32_t error_code; /* 10 */
    uint32_t eip; /* 11 */
    uint16_t cs_sel; /* 12 */
    uint16_t cs_sel_h;
    unsigned long eflags; /* 13 */
    uint32_t esp1; /* 14 */
    uint16_t ss_sel; /* 15 */
    uint16_t ss_sel_h;
    /* additionnal space to handle 16 bit return */
    uint32_t dummy[2]; 
};
#endif

#define MON_STACK_SIZE 4096

struct __attribute__((packed)) desc {
    uint16_t limit;
    unsigned long base;
};

#ifdef __x86_64__
struct  __attribute__((packed)) kqemu_tss {
    uint32_t reserved_0;
    uint64_t rsp0;
    uint64_t rsp1;
    uint64_t rsp2;
    uint64_t reserved_1;
    uint64_t ist[7];
    uint64_t reserved_2;
    uint16_t res_3;
    uint16_t bitmap;
};
#else
struct kqemu_tss {
    unsigned short	back_link,__blh;
    unsigned long	esp0;
    unsigned short	ss0,__ss0h;
    unsigned long	esp1;
    unsigned short	ss1,__ss1h;
    unsigned long	esp2;
    unsigned short	ss2,__ss2h;
    unsigned long	__cr3;
    unsigned long	eip;
    unsigned long	eflags;
    unsigned long	eax,ecx,edx,ebx;
    unsigned long	esp;
    unsigned long	ebp;
    unsigned long	esi;
    unsigned long	edi;
    unsigned short	es, __esh;
